{"backend": "theano", "config": [{"config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 7], "name": "dense_1", "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.4", "class_name": "Sequential"}